/* CV2 DSP API header file - common
Revision: 43821
Last Changed Rev: 43790
Last Changed Date: 2022-01-25 02:15:41 -0800 (Tue, 25 Jan 2022)
*/
/**
 * @file cmd_msg_dsp.h
 *
 *  Copyright (c) 2020 Ambarella International LP
 *
 *  This file and its contents ("Software") are protected by intellectual
 *  property rights including, without limitation, U.S. and/or foreign
 *  copyrights. This Software is also the confidential and proprietary
 *  information of Ambarella International LP and its licensors. You may not use, reproduce,
 *  disclose, distribute, modify, or otherwise prepare derivative works of this
 *  Software or any portion thereof except pursuant to a signed license agreement
 *  or nondisclosure agreement with Ambarella International LP or its authorized affiliates.
 *  In the absence of such an agreement, you agree to promptly notify and return
 *  this Software to Ambarella International LP.
 *
 *  THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 *  INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF NON-INFRINGEMENT,
 *  MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 *  IN NO EVENT SHALL AMBARELLA INTERNATIONAL LP OR ITS AFFILIATES BE LIABLE FOR ANY DIRECT,
 *  INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 *  (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 *  LOSS OF USE, DATA, OR PROFITS; COMPUTER FAILURE OR MALFUNCTION; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 *
 * @brief application(product) independent part of DSP API.
 */

#ifndef CMD_MSG_DSP_H_
#define CMD_MSG_DSP_H_

#include <dsp_types.h>

#define IMG_MODE_LOW_ISO_VIDEO 95u

#define CFG_PASS_INVLAID 0xFFu
#define CFG_STEP_INVLAID 0xFFu

////////////////////////////////////////////////////////////////////////////////

typedef uint8_t pass_step_id_t;

#define IMG_PASS_VIN            0u
#define IMG_PASS_C2Y            1u
#define IMG_PASS_Y2Y            2u
#define IMG_PASS_STEP_INVALID   255u

////////////////////////////////////////////////////////////////////////////////
#define SIL_VER_INVALID         0u
#define SIL_VER_ENGINEERING     99

//#ifdef PROJECT_CV2A
#define SIL_VER_CV2FS25      20250
#define SIL_VER_CV2FS75      20750
#define SIL_VER_CV2FS85      20850
#define SIL_VER_CV22FS15     30150
#define SIL_VER_CV22FS55     30550
#define SIL_VER_CV22FS85     30850
#define SIL_VER_CV20AQ25     40250
#define SIL_VER_CV20AQ75     40750
#define SIL_VER_CV20AQ85     40850
//#endif

/* located at 0x100 */
typedef struct
{
  uint32_t ucode_version;
  uint32_t ucode_date;
  uint32_t ucode_api_version;
  uint32_t ucode_silicon_version;
  uint32_t ucode_link_base;

} ucode_info_t;

#define DSP_SYNC_COUNTER_CMD_REQ_VDSP0   19u  /* Sync Counter for VDSP0 command request */
#define DSP_SYNC_COUNTER_CMD_REQ_VDSP1   20u  /* Sync Counter for VDSP1 command request */
#define DSP_SYNC_COUNTER_IDSP_VP_MSG     127u /* Sync Counter for IDSP VP message */

#define MAX_NUM_DSP_CMD_Q 6u
#define MAX_NUM_DSP_MSG_Q 8u

typedef struct
{
  uint32_t base_daddr;   /* base daddr of Message FIFO */
  uint32_t max_num_msg;  /* maximum number of messages */
  uint32_t read_ptr;     /* read pointer */
  uint32_t write_ptr;    /* write pointer */
  uint32_t reserved[12];

} dsp_msg_q_info_t;

/* prt_period locates at chip_id_daddr+8 */
typedef struct
{
  uint8_t payload[64];      /* iv:                  : 16 bytes (128 bits) */
                            /* uid and audio ticks  : 32 bytes (256 bits) */
                            /* audio ticks          : 4  bytes  (32 bits) */
                            /* rsvd                 : 12 bytes */
} prt_period;

typedef struct
{
  uint32_t module;        // 4B
  uint32_t file_name;     // 8B
  uint32_t file_line;     // 12B
  uint32_t prn_str;       // 16B
  uint32_t prn_arg1;      // 20B
  uint32_t prn_arg2;      // 24B
  uint32_t prn_arg3;      // 28B
  uint32_t prn_arg4;      // 32B
  uint32_t prn_arg5;      // 36B

} assert_info_t;          // For system/ucode agreement :
                          // This assert_info_t Must allocate 64 bytes align

typedef struct
{
  assert_info_t info[8];   // 8 threads's assert info
} orc_assert_t;

/* located at 0x200 */
typedef struct
{
  /* Off-line predefined binary data */
  uint32_t default_binary_data_daddr;                                      /* 4B */
  uint32_t default_binary_data_dsize;                                      /* 8B */

  /* Default commands */
  uint32_t default_config_daddr;                                           /* 12B */
  uint32_t default_config_dsize;                                           /* 16B */

  /* Continguous DRAM space assgined to DSP */
  uint32_t dsp_dram_daddr;                                                 /* 20B */
  uint32_t dsp_dram_size;                                                  /* 24B */

  /* Extended IDSP memory for ucode */
  uint32_t idsp_ext_dram_daddr;                                            /* 28B */
  uint32_t idsp_ext_dram_dsize;                                            /* 32B */

  /* DSP printf area */
  uint32_t dsp_debug_daddr;                                                /* 36B */
  uint32_t dsp_debug_dsize;                                                /* 40B */

  /* DSP command */
  uint32_t cmd_data_daddr[MAX_NUM_DSP_CMD_Q];                              /* 64B */
  uint32_t cmd_data_dsize[MAX_NUM_DSP_CMD_Q];                              /* 88B */

  uint32_t cmd_req_timer                  : 4;                             /* sync counter timer in ms. ( only 1 ~ 4 ms allowed ) */
  uint32_t msg_q_full_assert              : 1;                             /* 0: no assert, 1: assert */
  uint32_t req_cmd_timeout_assert         : 1;                             /* 0: no assert, 1: assert */
  uint32_t run_with_vp                    : 1;
  uint32_t enable_vout_ln_sync_monitor    : 1;
  uint32_t is_orccode_fully_load          : 1;                             /* This bit is used under is_partial_load_en=1,
                                                                              when orccode.bin is fully loaded, system set this bit as 1 */
  uint32_t data_prot_safety_enabled       : 2;                             /* 0 : no ASIL 26262 safety mechanism is enabled.
                                                                              1 : safety mechanism is enabled.
                                                                              Other values are undefined. */
  uint32_t reserved_0                     : 21;                            /* 92B */

  /* DSP message */
  uint32_t msg_q_info_data_daddr[MAX_NUM_DSP_MSG_Q];                       /* 124B */

  /* chip_id pointer. Can point to efuse ID and much more in future. */
  uint32_t chip_id_daddr;                                                  /* 128B */

  /* The dram buffer for orc_assert_t */
  uint32_t orc_assert_daddr;                                               /* 132B */

  /*  If is_prt_opt=1,
   *  System MUST allocate a dram buffer of 64 bytes (size of prt_period).
   *  This dram buffer base is chip_id_daddr+8 !
   */
  uint32_t is_prt_opt                     : 2;
  uint32_t delta_audio_ticks              : 30;                            /* 136B */

  uint32_t att_prot_dram_daddr;                                            /* The dram space that is protected by ATT table to exclusively dedicate to the DSP */
  uint32_t att_prot_dram_dsize;                                            /* The size of the ATT protected dram space. */
  uint32_t dram_exclusion_region_num      : 8;                             /* The number of the dram segments that are excluded from DSP to use.
                                                                              Max value is 4 [i.e. valid values are 0, 1, 2, 3, and 4].
                                                                              If value = 0, then all following parameters should be filled with 0x0.*/
  uint32_t reserved_1                     : 24;                            /* 148B */
  uint32_t dram_exclusion_region_0_daddr;                                  /* The first exclusion region's starting address */
  uint32_t dram_exclusion_region_0_dsize;                                  /* The first exclusion region's size */
  uint32_t dram_exclusion_region_1_daddr;                                  /* The second exclusion region's starting address */
  uint32_t dram_exclusion_region_1_dsize;                                  /* The second exclusion region's size */
  uint32_t dram_exclusion_region_2_daddr;                                  /* The third exclusion region's starting address */
  uint32_t dram_exclusion_region_2_dsize;                                  /* The third exclusion region's size */
  uint32_t dram_exclusion_region_3_daddr;                                  /* The fourth exclusion region's starting address */
  uint32_t dram_exclusion_region_3_dsize;                                  /* The fourth exclusion region's size */
                                                                           /* 180B */
  uint32_t assertion_deselect_mask;                                        /* Indicates which module is "not" going to set cehu error bit when fatal error happens */
                                                                           /* 184B */
  uint32_t watchdog_cnt_ptr;                                               /* A pointer to a dream area of 4*(uint32_t), i.e. an array of 4 integers */
                                                                           /* whose element 0: VDSP0 (VOUT), 1: VDSP1 (VIN), 2: VDSP2 (VPROC), 3: VDSP3 (ENC). */
                                                                           /* If the watchdog counter pointer is 0x0, ucode will not accumulate ISRs to the system. */
                                                                           /* 188B */
  uint32_t enet_timer_diff_threshold;                                      /* the threashold of difference of enet_timer0 and enet_timer1 */

#ifdef SUPPORT_DSP_MSG_CRC
  uint32_t padding[15];                                                    /* Padding up to 252B */
  uint32_t crc_init_data;                                                  /* 256B */
#else
  uint32_t padding[16];                                                    /* Padding up to 252B */
#endif
} dsp_init_data_t;


////////////////////////////////////////////////////////////////////////////////
/* same as H.264 standard (table 6-1) */
typedef uint8_t yuv_chroma_fmt_t;

#define YUV_MONO 0u /* Y only */
#define YUV_420  1u
#define YUV_422  2u
#define YUV_444  3u

////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Macro Defines
////////////////////////////////////////////////////////////////////////////////

#define DSP_CMD_SIZE            128u
#define DSP_MSG_SIZE            128u

#define DSP_CMD_NUM             32u
#define DSP_MSG_NUM             32u

/* DSP command format */
typedef struct
{
  uint32_t  cmd_code;
  uint32_t  pay_load[(DSP_CMD_SIZE / 4u) - 1u];

