/* CV5 DSP API header file
Commit: 866f87a68201ebaf124b7b0b3c0c277a4bc392e9
Last Changed Commit: 406d04d8eb6dbd3c1eb73ac065f2a8ccc55ab069
Last Changed Date: 2023-01-02 05:37:19 -0800
*/
/**
 * @file cmd_msg_dsp.h
 *
 *  Copyright (c) 2021 Ambarella International LP
 *
 *  This file and its contents ("Software") are protected by intellectual
 *  property rights including, without limitation, U.S. and/or foreign
 *  copyrights. This Software is also the confidential and proprietary
 *  information of Ambarella International LP and its licensors. You may not use, reproduce,
 *  disclose, distribute, modify, or otherwise prepare derivative works of this
 *  Software or any portion thereof except pursuant to a signed license agreement
 *  or nondisclosure agreement with Ambarella International LP or its authorized affiliates.
 *  In the absence of such an agreement, you agree to promptly notify and return
 *  this Software to Ambarella International LP.
 *
 *  THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 *  INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF NON-INFRINGEMENT,
 *  MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 *  IN NO EVENT SHALL AMBARELLA INTERNATIONAL LP OR ITS AFFILIATES BE LIABLE FOR ANY DIRECT,
 *  INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 *  (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 *  LOSS OF USE, DATA, OR PROFITS; COMPUTER FAILURE OR MALFUNCTION; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 *
 * @brief application(product) independent part of DSP API.
 */

#ifndef CMD_MSG_DSP_H_
#define CMD_MSG_DSP_H_

#include <dsp_types.h>

#define PROJECT_CV5

#define IMG_MODE_LOW_ISO_VIDEO 95u
#define IMG_MODE_HIGH_ISO_STILL 99u

#define CFG_PASS_INVLAID 0xFFu
#define CFG_STEP_INVLAID 0xFFu

////////////////////////////////////////////////////////////////////////////////

typedef uint8_t pass_step_id_t;

#define IMG_PASS_VIN            0u
#define IMG_PASS_C2Y            1u
#define IMG_PASS_Y2Y            2u
#define IMG_PASS_OSD_BLEND      3u
#define IMG_PASS_MD_BASE        4u
#define IMG_PASS_ME1_SMTH       IMG_PASS_MD_BASE
#define IMG_PASS_MD_A           5u
#define IMG_PASS_MD_B           6u
#define IMG_PASS_MD_C           7u
#define IMG_PASS_FISHI          8u
#define IMG_PASS_HI_BASE        16u
#define IMG_PASS_STEP_INVALID   255u

#define VPROC_MAIN_STREAM_IDX 0u /* mcts/mctf */
#define VPROC_PIP_STREAM_IDX  1u /* preview A */
#define VPROC_3RD_STREAM_IDX  2u /* preview B */
#define VPROC_4TH_STREAM_IDX  3u /* preview C */
#define VPROC_5TH_STREAM_IDX  4u /* preview D */
#define VPROC_6TH_STREAM_IDX  5u /* mixer scaler */
#define VPROC_7TH_STREAM_IDX  6u /* hier */
#define VPROC_STREAM_NUMS     7u

////////////////////////////////////////////////////////////////////////////////
#define SIL_VER_INVALID         0u
#define SIL_VER_ENGINEERING     99u

#ifdef PROJECT_CV5
// FIXME define SIL_VER_XXXX???

#define SIL_VER_CV5AX55     10550
#define SIL_VER_CV5AX55R    11550
#define SIL_VER_CV5AX85     10850
#define SIL_VER_CV5A55      20550
#define SIL_VER_CV5A85      20850
#define SIL_VER_CV52AX55    30550
#define SIL_VER_CV52AX75    30750
#define SIL_VER_CV52AX85    30850
#define SIL_VER_CV52A55     40550
#define SIL_VER_CV52A75     40750
#define SIL_VER_CV52A85     40850
#define SIL_VER_CV5U55      50550
#define SIL_VER_CV5U85      50850
#define SIL_VER_CV52U75     60750
#define SIL_VER_CV52U85     60850
#endif

/* located at 0x100 */
typedef struct
{
  uint32_t ucode_version;
  uint32_t ucode_date;
  uint32_t ucode_api_version;
  uint32_t ucode_silicon_version;
  uint32_t ucode_link_base;
} ucode_info_t;

typedef struct
{
  uint32_t ucode_version_w0;
  uint32_t ucode_version_w1;
  uint32_t ucode_version_w2;
  uint32_t ucode_version_w3;
  uint32_t ucode_version_w4;
} ucode_ver_t;

typedef struct
{
  uint32_t ucode_api_version_w0;
  uint32_t ucode_api_version_w1;
  uint32_t ucode_api_version_w2;
  uint32_t ucode_api_version_w3;
  uint32_t ucode_api_version_w4;
} ucode_api_ver_t;

typedef struct
{
  uint32_t common_version_w0;
  uint32_t common_version_w1;
  uint32_t common_version_w2;
  uint32_t common_version_w3;
  uint32_t common_version_w4;
} common_ver_t;

typedef struct
{
  uint32_t idspdrv_version_w0;
  uint32_t idspdrv_version_w1;
  uint32_t idspdrv_version_w2;
  uint32_t idspdrv_version_w3;
  uint32_t idspdrv_version_w4;
} idspdrv_ver_t;

typedef struct
{
  uint32_t orcmdxf_version_w0;
  uint32_t orcmdxf_version_w1;
  uint32_t orcmdxf_version_w2;
  uint32_t orcmdxf_version_w3;
  uint32_t orcmdxf_version_w4;
} orcmdxf_ver_t;

typedef struct
{
  uint32_t orcme_version_w0;
  uint32_t orcme_version_w1;
  uint32_t orcme_version_w2;
  uint32_t orcme_version_w3;
  uint32_t orcme_version_w4;
} orcme_ver_t;

typedef struct
{
  uint32_t commit_time_w0;
  uint32_t commit_time_w1;
} ucode_commit_time_t;

typedef struct
{
  ucode_info_t    ucode_info;
  ucode_ver_t     ucode_ver;
  ucode_api_ver_t ucode_api_ver;
  common_ver_t    common_ver;
  idspdrv_ver_t   idspdrv_ver;
  orcmdxf_ver_t   orcmdxf_ver;
  orcme_ver_t     orcme_ver;
  ucode_commit_time_t commit_time;
} ucode_info_full_t;

#define PIC_STATS_DUMP_MAX_NUM (8)
#define PIC_STATS_DUMP_SHIFT   (13)
#define PIC_STATS_DUMP_SIZE    (1 << (PIC_STATS_DUMP_SHIFT)) /* bytes */

typedef struct
{
/* xf_stat */
    uint16_t xfMbCatHisto[16];
    uint32_t rsvd[32]; /* (64 + 64)/4 */
/* Nom QP Table */
    uint8_t qp[16];
}pic_stats_avc_t;

#define DSP_SYNC_COUNTER_CMD_REQ_VDSP0   19u  /* Sync Counter for VDSP0 command request */
#define DSP_SYNC_COUNTER_CMD_REQ_VDSP1   20u  /* Sync Counter for VDSP1 command request */
#define DSP_SYNC_COUNTER_CMD_REQ_ASYNC   21u  /* Sync Counter for Async command queue (CV5: VDSP2, CV6: OrcVin1 VDSP0) */
#ifndef PROJECT_CV5
#define DSP_SYNC_COUNTER_CMD_REQ_VIN_1   22u  /* Sync Counter for OrcVin1 command queue (OrcVin1 VDSP1) */
#endif
#define DSP_SYNC_COUNTER_IDSP_VP_MSG     255u /* Sync Counter for IDSP VP message */

/* DSP API types */
#define DSP_API_CMD_MSG_MAIN    0u /* for flows running on orcvin only, VOUT frame-based timing */
#define DSP_API_CMD_MSG_VIN     1u /* for flows running on orcvin only, VIN frame-based timing */
#define DSP_API_CMD_MSG_ASYNC   2u /* for async flow running on orcvin */
#ifndef PROJECT_CV5
#define DSP_API_CMD_VIN_1       3u /* for flows running on orcvin1 only, VIN frame-based timing */
#endif
#define DSP_API_MSG_VPROC       3u /* for vproc flow running on orcidsp1 only */
#define DSP_API_MSG_IDSP_VP     4u /* for vproc flow running on orcidsp1 only */
#define DSP_API_MSG_CODEC       5u /* for flows running on orccodec only, enc/dec */
#ifndef PROJECT_CV5
#define DSP_API_MSG_VIN_1       6u /* for flows running on orcvin1 only, VIN frame-based timing */
#define DSP_API_MSG_VIN_VP      7u /* for flows running on orcvin/orcvin1 only, VIN frame-based timing */
#endif

#define MAX_NUM_DSP_CMD_Q 6u
#define MAX_NUM_DSP_MSG_Q 8u

typedef struct
{
  uint32_t base_daddr;   /* base daddr of Message FIFO */
  uint32_t max_num_msg;  /* maximum number of messages */
  uint32_t read_ptr;     /* read pointer */
  uint32_t write_ptr;    /* write pointer */
  uint32_t reserved[12];

} dsp_msg_q_info_t;

/* prt_period locates at chip_id_daddr+8 */
typedef struct
{
  uint8_t payload[64];      /* iv:                  : 16 bytes (128 bits) */
                            /* uid and audio ticks  : 32 bytes (256 bits) */
                            /* audio ticks          : 4  bytes  (32 bits) */
                            /* rsvd                 : 12 bytes */
} prt_period;

typedef struct
{
  uint32_t module;        // 4B
  uint32_t file_name;     // 8B
  uint32_t file_line;     // 12B
  uint32_t prn_str;       // 16B
  uint32_t prn_arg1;      // 20B
  uint32_t prn_arg2;      // 24B
  uint32_t prn_arg3;      // 28B
  uint32_t prn_arg4;      // 32B
  uint32_t prn_arg5;      // 36B

} assert_info_t;

// For system/ucode agreement:
// This assert_info_dram_t must be 128-byte aligned
typedef struct
{
  assert_info_t assert_info;
  uint32_t      reserved[23];
} assert_info_dram_t;


/****************************************************************************
 * ORC_TH_GLOBAL_ID for COMMON_SMEM_TH index and assertion
 *
 * CV5 ORC_TOTAL_THREADS=16 :
 * ORC_TH_GLOBAL_ID = 0,  1,  2,  3,  for orccode
 * ORC_TH_GLOBAL_ID = 4,  5,  6,  7,  for orcvin
 * ORC_TH_GLOBAL_ID = 8,  9,  10, 11, for orcidsp0
 * ORC_TH_GLOBAL_ID = 12, 13, 14, 15, for orcidsp1
 *
 * CV6 ORC_TOTAL_THREADS=20:
 * ORC_TH_GLOBAL_ID = 0,  1,  2,  3,  for orccode
 * ORC_TH_GLOBAL_ID = 4,  5,  6,  7,  for orcvin(0)
 * ORC_TH_GLOBAL_ID = 8,  9,  10, 11, for orcvin1
 * ORC_TH_GLOBAL_ID = 12, 13, 14, 15, for orcidsp0
 * ORC_TH_GLOBAL_ID = 16, 17, 18, 19, for orcidsp1
 ***************************************************************************/
#ifdef PROJECT_CV6
#define ORC_TOTAL_THREADS 20u
#else /* CV5 */
#define ORC_TOTAL_THREADS 16u
#endif
typedef struct
{
  assert_info_dram_t info[ORC_TOTAL_THREADS];
} orc_assert_t;

/* located at DSP_INIT_DATA_BASE(0x200) defined in ld_defs.h */
#define DSP_INIT_DATA_SIZE 256u
typedef struct
{
  /* Off-line predefined binary data */
  uint32_t default_binary_data_daddr;                 /* 4B */
  uint32_t default_binary_data_dsize;                 /* 8B */

  /* Default commands */
  uint32_t default_config_daddr;                      /* 12B */
  uint32_t default_config_dsize;                      /* 16B */

  /* Continguous DRAM space assgined to DSP */
  uint32_t dsp_dram_daddr;                            /* 20B */
  uint32_t dsp_dram_size;                             /* 24B */

  /* Extended IDSP memory for ucode */
  uint32_t idsp_ext_dram_daddr;                       /* 28B */
  uint32_t idsp_ext_dram_dsize;                       /* 32B */

  /* DSP printf area */
  uint32_t dsp_debug_daddr;                           /* 36B */
  uint32_t dsp_debug_dsize;                           /* 40B */

  /* DSP command */
  uint32_t cmd_data_daddr[MAX_NUM_DSP_CMD_Q];         /* 64B */
  uint32_t cmd_data_dsize[MAX_NUM_DSP_CMD_Q];         /* 88B */

  uint32_t cmd_req_timer               :4;            /* sync counter timer in ms. ( only 1 ~ 4 ms allowed ) */
  uint32_t msg_q_full_assert           :1;            /* 0: no assert, 1: assert */
  uint32_t req_cmd_timeout_assert      :1;            /* 0: no assert, 1: assert */
  uint32_t run_with_vp                 :1;
  uint32_t enable_vout_ln_sync_monitor :1;
  uint32_t is_orccode_fully_load       :1;            /* This bit is used under is_partial_load_en=1,
                                                         when orccode.bin is fully loaded, system set this bit as 1 */
  uint32_t data_prot_safety_enabled    :2;            /* 0 : no ASIL 26262 safety mechanism is enabled.
                                                         1 : safety mechanism is enabled.
                                                         Other values are undefined. */
  uint32_t orc_printf_ver              :2;            /* orc_printf version number */
  uint32_t use_debug_chip_id           :1;
  uint32_t reserved_0                  :18;           /* 92B */

  /* DSP message */
  uint32_t msg_q_info_data_daddr[MAX_NUM_DSP_MSG_Q];  /* 124B */

  /* chip_id pointer */
  uint32_t chip_id_daddr;                             /* 128B */

  /* The dram buffer for orc_assert_t */
  uint32_t orc_assert_daddr;                          /* 132B */

  /*  If is_prt_opt=1,
   *  System MUST allocate a dram buffer of 64 bytes (size of prt_period).
   *  This dram buffer base is chip_id_daddr+8 !
   */
  uint32_t is_prt_opt        :2;
  uint32_t delta_audio_ticks :30;                     /* 136B */

  uint32_t att_prot_dram_daddr;                       /* The dram space that is protected by ATT table to exclusively dedicate to the DSP */
  uint32_t att_prot_dram_dsize;                       /* The size of the ATT protected dram space. */
  uint32_t dram_exclusion_region_num :8;              /* The number of the dram segments that are excluded from DSP to use.
                                                         Max value is 4 [i.e. valid values are 0, 1, 2, 3, and 4].
                                                         If value = 0, then all following parameters should be filled with 0x0.*/
  uint32_t reserved_1                :24;             /* 148B */

  uint32_t dram_exclusion_region_0_daddr;             /* The first exclusion region's starting address */
  uint32_t dram_exclusion_region_0_dsize;             /* The first exclusion region's size */
  uint32_t dram_exclusion_region_1_daddr;
  uint32_t dram_exclusion_region_1_dsize;
  uint32_t dram_exclusion_region_2_daddr;
  uint32_t dram_exclusion_region_2_dsize;
  uint32_t dram_exclusion_region_3_daddr;
  uint32_t dram_exclusion_region_3_dsize;             /* 180B */

  /* DSP message write pointer, started from CV6 */
  uint32_t msg_q_wr_daddr[MAX_NUM_DSP_MSG_Q];         /* 212B */

  uint32_t padding[10];                               /* Padding up to 252B */
  uint32_t crc_init_data;                             /* 256B */

} dsp_init_data_t;


/******************************************************************************
 * Macro Defines
 *****************************************************************************/
/* same as H.264 standard (table 6-1) */
typedef uint8_t yuv_chroma_fmt_t;

#define YUV_MONO 0u /* Y only */
#define YUV_420  1u
#define YUV_422  2u
#define YUV_444  3u

#define IDSP_SBUF_MCBL_NUM 3u /* for the sblk=1,2,3 accordingly */

#ifdef PROJECT_CV6
#define MAX_REAL_VIN_NUM         24u
#define MAX_REAL_VIN_BIT_MASK    0xffffffu
#else /* default is CV5 */
#define MAX_REAL_VIN_NUM         14u
#define MAX_REAL_VIN_BIT_MASK    0x3fffu
#endif

#define VIRTUAL_VIN_ID_0    (MAX_REAL_VIN_NUM)

#ifdef PROJECT_CV6
#define MAX_VIRTUAL_VIN_NUM 8u
#define MAX_VIN_TEMPORAL_DEMUX_NUM 9u /* 1u + MAX_VIRTUAL_VIN_NUM */
#else
#define MAX_VIRTUAL_VIN_NUM 12u
#define MAX_VIN_TEMPORAL_DEMUX_NUM 13u /* 1u + MAX_VIRTUAL_VIN_NUM */
#endif

