/* H2E DSP API header file - common
Revision: 289982
Last Changed Rev: 289982
Last Changed Date: 2022-12-09 03:23:34 -0800 (Fri, 09 Dec 2022)
*/
/**
 * @file cmd_msg_dsp.h
 *
 * @brief application(product) independent part of DSP API.
 *
 *  Copyright (c) 2020 Ambarella International LP
 *
 *  This file and its contents ("Software") are protected by intellectual
 *  property rights including, without limitation, U.S. and/or foreign
 *  copyrights. This Software is also the confidential and proprietary
 *  information of Ambarella International LP and its licensors. You may not use, reproduce,
 *  disclose, distribute, modify, or otherwise prepare derivative works of this
 *  Software or any portion thereof except pursuant to a signed license agreement
 *  or nondisclosure agreement with Ambarella International LP or its authorized affiliates.
 *  In the absence of such an agreement, you agree to promptly notify and return
 *  this Software to Ambarella International LP.
 *
 *  THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 *  INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF NON-INFRINGEMENT,
 *  MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 *  IN NO EVENT SHALL AMBARELLA INTERNATIONAL LP OR ITS AFFILIATES BE LIABLE FOR ANY DIRECT,
 *  INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 *  (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;

#define SIL_VER_ENGINEERING     99u

#ifdef PROJECT_CV2S
#define SIL_VER_CV22A15         1150u
#define SIL_VER_CV22A25         1250u
#define SIL_VER_CV22A35         1350u
#define SIL_VER_CV22A55         1550u
#define SIL_VER_CV22A75         1750u
#define SIL_VER_CV22A85         1851u
#define SIL_VER_CV22U85         1850u

#define SIL_VER_CV22AX15        4150u
#define SIL_VER_CV22AX25        4250u
#define SIL_VER_CV22AX35        4350u
#define SIL_VER_CV22AX55        4550u
#define SIL_VER_CV22AX75        4750u
#define SIL_VER_CV22AX85        4850u
#define SIL_VER_CV22AX99        4990u

#define SIL_VER_CV22AQ15        5150u
#define SIL_VER_CV22AQ25        5250u
#define SIL_VER_CV22AQ35        5350u
#define SIL_VER_CV22AQ55        5550u
#define SIL_VER_CV22AQ75        5750u
#define SIL_VER_CV22AQ85        5850u
#define SIL_VER_CV22AQ99        5990u
#elif defined(PROJECT_CV2E)
/*CV25*/
#define SIL_VER_CV25A15         401150u
#define SIL_VER_CV25A25         401250u
#define SIL_VER_CV25A35         401350u
#define SIL_VER_CV25A75         401750u
#define SIL_VER_CV25A85         401850u
#define SIL_VER_CV25A90         401900u

#define SIL_VER_CV25AX15        404150u
#define SIL_VER_CV25AX25        404250u
#define SIL_VER_CV25AX35        404350u
#define SIL_VER_CV25AX75        404750u
#define SIL_VER_CV25AX85        404850u

#define SIL_VER_CV25AQ15        405150u
#define SIL_VER_CV25AQ25        405250u
#define SIL_VER_CV25AQ35        405350u
#define SIL_VER_CV25AQ75        405750u
#define SIL_VER_CV25AQ99        405990u
#elif defined(PROJECT_H2E)
/*H32*/
#define SIL_VER_H32A25          501250u
#define SIL_VER_H32A35          501350u
#define SIL_VER_H32A75          501750u
#define SIL_VER_H32A85          501850u

#define SIL_VER_H32AX25         504250u
#define SIL_VER_H32AX35         504350u
#define SIL_VER_H32AX75         504750u
#define SIL_VER_H32AX85         504850u

#define SIL_VER_H32AQ15         505150u
#define SIL_VER_H32AQ25         505250u
#define SIL_VER_H32AQ35         505350u
#define SIL_VER_H32AQ75         505750u

#define SIL_VER_H32_S6L_56M     550656u

#elif defined(PROJECT_CV2L)
/*CV28*/
#define SIL_VER_CV28A25         601250u
#define SIL_VER_CV28A35         601350u
#define SIL_VER_CV28A75         601750u
#define SIL_VER_CV28A85         601850u

#define SIL_VER_CV28AX25        604250u
#define SIL_VER_CV28AX35        604350u
#define SIL_VER_CV28AX75        604750u
#define SIL_VER_CV28AX85        604850u

#define SIL_VER_CV28AQ10        605100u
#define SIL_VER_CV28AQ15        605150u
#define SIL_VER_CV28AQ25        605250u
#define SIL_VER_CV28AQ35        605350u
#define SIL_VER_CV28AQ75        605750u

#else
/*CV2*/
#define SIL_VER_CV2U80          201800u
#define SIL_VER_CV2U85          201850u

#define SIL_VER_CV2AX80         204800u
#define SIL_VER_CV2AX85         204850u

#define SIL_VER_CV2AQ70         205700u
#define SIL_VER_CV2AQ75         205750u
#define SIL_VER_CV2AQ80         205800u
#define SIL_VER_CV2AQ99         205990u
#endif

/* located at 0x100 */
typedef struct
{
  uint32_t ucode_version;
  uint32_t ucode_date;
  uint32_t ucode_api_version;
  uint32_t ucode_silicon_version;
  uint32_t ucode_link_base;

} ucode_info_t;

#define DSP_SYNC_COUNTER_CMD_REQ_VDSP0   10u  /* Sync Counter for VDSP0 command request */
#define DSP_SYNC_COUNTER_CMD_REQ_VDSP1   11u  /* Sync Counter for VDSP1 command request */
#define DSP_SYNC_COUNTER_IDSP_VP_MSG     127u /* Sync Counter for IDSP VP message */

#define MAX_NUM_DSP_CMD_Q 6u
#define MAX_NUM_DSP_MSG_Q 8u

typedef struct
{
  uint32_t base_daddr;   /* base daddr of Message FIFO */
  uint32_t max_num_msg;  /* maximum number of messages */
  uint32_t read_ptr;     /* read pointer */
  uint32_t write_ptr;    /* write pointer */
  uint32_t reserved[12];

} dsp_msg_q_info_t;

/* prt_period locates at chip_id_daddr+8 */
typedef struct
{
  uint8_t payload[64];      /* iv:                  : 16 bytes (128 bits) */
                            /* uid and audio ticks  : 32 bytes (256 bits) */
                            /* audio ticks          : 4  bytes  (32 bits) */
                            /* rsvd                 : 12 bytes */
} prt_period;

typedef struct
{
  uint32_t module;        // 4B
  uint32_t file_name;     // 8B
  uint32_t file_line;     // 12B
  uint32_t prn_str;       // 16B
  uint32_t prn_arg1;      // 20B
  uint32_t prn_arg2;      // 24B
  uint32_t prn_arg3;      // 28B
  uint32_t prn_arg4;      // 32B
  uint32_t prn_arg5;      // 36B

} assert_info_t;          // For system/ucode agreement :
                          // This assert_info_t Must allocate 64 bytes align

typedef struct
{
  assert_info_t info[8];   // 8 threads's assert info
} orc_assert_t;

/* located at 0x200 */
typedef struct
{
  /* Off-line predefined binary data */
  uint32_t default_binary_data_daddr;                                      /* 4B */
  uint32_t default_binary_data_dsize;                                      /* 8B */

  /* Default commands */
  uint32_t default_config_daddr;                                           /* 12B */
  uint32_t default_config_dsize;                                           /* 16B */

  /* Continguous DRAM space assgined to DSP */
  uint32_t dsp_dram_daddr;                                                 /* 20B */
  uint32_t dsp_dram_size;                                                  /* 24B */

  /* Extended IDSP memory for ucode */
  uint32_t idsp_ext_dram_daddr;                                            /* 28B */
  uint32_t idsp_ext_dram_dsize;                                            /* 32B */

  /* DSP printf area */
  uint32_t dsp_debug_daddr;                                                /* 36B */
  uint32_t dsp_debug_dsize;                                                /* 40B */

  /* DSP command */
  uint32_t cmd_data_daddr[MAX_NUM_DSP_CMD_Q];                              /* 64B */
  uint32_t cmd_data_dsize[MAX_NUM_DSP_CMD_Q];                              /* 88B */

  uint32_t cmd_req_timer                  : 4;                             /* sync counter timer in ms */
  uint32_t msg_q_full_assert              : 1;                             /* 0: no assert, 1: assert */
  uint32_t req_cmd_timeout_assert         : 1;                             /* 0: no assert, 1: assert */
  uint32_t run_with_vp                    : 1;
  uint32_t enable_vout_ln_sync_monitor    : 1;
  uint32_t is_orccode_fully_load          : 1;                             /* This bit is used under is_partial_load_en=1,
                                                                              when orccode.bin is fully loaded, system set this bit as 1 */
  uint32_t reserved                       : 23;                            /* 92B */

  /* DSP message */
  uint32_t msg_q_info_data_daddr[MAX_NUM_DSP_MSG_Q];                       /* 124B */

  /* chip_id pointer. Can point to efuse ID and much more in future. */
  uint32_t chip_id_daddr;                                                  /* 128B */

  /* The dram buffer for orc_assert_t */
  uint32_t orc_assert_daddr;                                               /* 132B */

  /*  If is_prt_opt=1,
   *  System MUST allocate a dram buffer of 64 bytes (size of prt_period).
   *  This dram buffer base is chip_id_daddr+8 !
   */
  uint32_t is_prt_opt                     :2;
  uint32_t delta_audio_ticks              :30;                             /* 136B */

  uint32_t padding[30];                                                    /* Padding up to 256B */

} dsp_init_data_t;


////////////////////////////////////////////////////////////////////////////////
/* same as H.264 standard (table 6-1) */
typedef uint8_t yuv_chroma_fmt_t;

#define YUV_MONO 0u /* Y only */
#define YUV_420  1u
#define YUV_422  2u
#define YUV_444  3u

////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Macro Defines
////////////////////////////////////////////////////////////////////////////////

#define DSP_CMD_SIZE            128u
#define DSP_MSG_SIZE            128u

#define DSP_CMD_NUM             32u
#define DSP_MSG_NUM             32u

/* DSP command format */
typedef struct
{
  uint32_t  cmd_code;
  uint32_t  pay_load[(DSP_CMD_SIZE / 4u) - 1u];

} dsp_cmd_t;

